In [2]:
#import the pandas libray
import pandas as pd

#creating a dictionary for data 

data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)

print(df)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

# Split Data into Groups

In [3]:
print(df.groupby('Team'))

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x000001B40181AA58>

# View Groups

In [4]:
print(df.groupby("Team").groups)

{'Devils': Int64Index([2, 3], dtype='int64'), 'Kings': Int64Index([4, 6, 7], dtype='int64'), 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'), 'Royals': Int64Index([9, 10], dtype='int64'), 'kings': Int64Index([5], dtype='int64')}

# Group by with multiple columns âˆ’

In [5]:
print(df.groupby(['Team','Year']).groups)

{('Devils', 2014): Int64Index([2], dtype='int64'), ('Devils', 2015): Int64Index([3], dtype='int64'), ('Kings', 2014): Int64Index([4], dtype='int64'), ('Kings', 2016): Int64Index([6], dtype='int64'), ('Kings', 2017): Int64Index([7], dtype='int64'), ('Riders', 2014): Int64Index([0], dtype='int64'), ('Riders', 2015): Int64Index([1], dtype='int64'), ('Riders', 2016): Int64Index([8], dtype='int64'), ('Riders', 2017): Int64Index([11], dtype='int64'), ('Royals', 2014): Int64Index([9], dtype='int64'), ('Royals', 2015): Int64Index([10], dtype='int64'), ('kings', 2015): Int64Index([5], dtype='int64')}

# Iterating through Groups

In [8]:
main_group = df.groupby("Points")

for name,group in main_group:
    print(name)
    print(group)

673
     Team  Rank  Year  Points
3  Devils     3  2015     673
690
      Team  Rank  Year  Points
11  Riders     2  2017     690
694
     Team  Rank  Year  Points
8  Riders     2  2016     694
701
     Team  Rank  Year  Points
9  Royals     4  2014     701
741
    Team  Rank  Year  Points
4  Kings     3  2014     741
756
    Team  Rank  Year  Points
6  Kings     1  2016     756
788
    Team  Rank  Year  Points
7  Kings     1  2017     788
789
     Team  Rank  Year  Points
1  Riders     2  2015     789
804
      Team  Rank  Year  Points
10  Royals     1  2015     804
812
    Team  Rank  Year  Points
5  kings     4  2015     812
863
     Team  Rank  Year  Points
2  Devils     2  2014     863
876
     Team  Rank  Year  Points
0  Riders     1  2014     876

# Select a Group

In [7]:
main_group.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

# Aggregations

In [9]:
import pandas as pd
import numpy as np

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')
grouped['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [10]:
grouped['Rank'].agg(np.mean)

Year
2014    2.5
2015    2.5
2016    1.5
2017    1.5
Name: Rank, dtype: float64

In [11]:
grouped.agg(np.size)

      Team  Rank  Points
Year
2014     4     4       4
2015     4     4       4
2016     2     2       2
2017     2     2       2

# Applying Multiple Aggregation Functions at Once

In [12]:
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

# Filtration

In [15]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [19]:
df['Team'].value_counts()

Riders    4
Kings     3
Royals    2
Devils    2
kings     1
Name: Team, dtype: int64